"""словари"""
# dict([[k, v], [k, v]])
# a = {'key1': "value1", 'key2': "value2"}
# b = a.pop('key3')
# print(b)

"""
FIFO --> first in first out
LIFO --> last in first out 
"""
# dict_["key4"] = "values4"  --> изменить словарь

# for  - работает с последовательностями, работает пока не дойдет до конца пеоследовательности

# while - работает пока условие верно

# continue - переходит в следущую итерацию

# break - останавливает цикл и переходит в следую операцию




"""list comprehension"""
# list_ = [i for i in range(50)]
# i --> что делаем с элементом
# for i  --> что берём в данном случае элемент i
# in range(50) --> откуда берём здесь из объекта функции range 

# list_ = [i for i in range(11) if i % 2 == 0]
# if --> это фильтр

"""dict comprehension"""

# set --> изменяемый, неупорядоченный, все элементы уникальны
# difference - это -(минус) какие элементы из первого set не находятся во втором
# symmetric_difference - какие элементы из первого set не не повторяются в обоих set
# intersection - какие элементы повторяются в обоих set
# union - объединяет сеты, не меняя сами сеты
# update - объединяет сеты, изменяя первый




